{
  "title": "Checkpoint XP Daily Podcast",
  "description": "Checkpoint XP is the first nationally syndicated radio show for esports and video games. The Checkpoint XP Daily Podcast is the Monday - Friday recordings that comprise the national radio show - plus additional conversations every single day! Stay up to date on pro League of Legends, PUBG, Overwatch and the biggest esports leagues. Be a part of the biggest discussions in esports like The International, or the Fornite World Cup with this interactive live podcast at our Twitch page twitch.tv/checkpointxp. Catch up on the latest esports and video game news with Nate, Robbie, Norris and Joe.",
  "image": "https://www.omnycontent.com/d/programs/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/image.jpg?t=1560530368&size=Large",
  "episodes": [
    {
      "title": "Disney+ Launches and Overwatch Home Games",
      "description": "This week the internet could only talk about one thing and that’s the launch of Disney+. From the Mandalorian to Avengers: Endgame, the 90s X-Men and Spider-Man to Gargoyles, there’s something for everyone. Plus, Robbie got to talk with the general manager of the Houston Outlaws about why the home and away game concept is so important in the Overwatch esports scene. Finally, we asked our social media followers what the weirdest game is they’ve ever played. In celebration of Death Stranding releasing, we talk about some of the strangest stuff out there.",
      "pubDate": "Wed, 13 Nov 2019 04:04:39 +0000",
      "length": "23546604",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/c56965d1-ec4f-4b00-b09b-ab040034d848/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1573617908"
    },
    {
      "title": "League of Legends and Death Stranding",
      "description": "The League of Legends World Championship went down this week bring an end to the 2019 season and it was a stomping as FunPlus Phoenix dominated G2 Esports. Norris and Joe walk us through all the action. We also talk about what we did over the weekend before the Snowmageddon hit on monday. Joe and Robbie also have a Q and A with Nate and Norris concerning Death Stranding, it’s all weird.",
      "pubDate": "Tue, 12 Nov 2019 01:37:35 +0000",
      "length": "15607417",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/0417e719-7549-4c1b-bdd6-ab030019cf7f/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1573522680"
    },
    {
      "title": "Ninja, FIFA Dodging and Gaming Sequels",
      "description": "A streamer was recently banned from Fortnite for using an aimbot in his content creation and was banned as a result. Ninja has cone on record stating that content creators should be treated differently from ‘normal gamers’. Plus, the Pro FIFA scene is in a rough spot as it comes out that some major pros have been using a discord to dodge playing each other in competitive play so they can all get the best possible play out. Finally, we take a list from IGN of the 25 games most deserving of a sequel.",
      "pubDate": "Sat, 09 Nov 2019 02:36:17 +0000",
      "length": "13928883",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7341d1f1-4cab-4b66-894d-ab000029fd5e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1573266997"
    },
    {
      "title": "China Restricts Gaming and Call of Duty League",
      "description": "China has always had a strong arm when it comes to the gaming industry and being one of the biggest countries in the world it’s a hot market for gaming profits. This week China’s newest laws on gaming restricts the amount of time those under the age of 18 can play as well as limits the amount of money they can spend on downloadable content in a month. Plus, with the holidays upon us, we thought it was about time we constructed a holiday buying guide. Finally, Call of Duty League has put out their full schedule for the inaugural 2020 season.",
      "pubDate": "Fri, 08 Nov 2019 01:52:58 +0000",
      "length": "15322984",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7fc6cd0b-82a0-47a5-bfa3-aaff001e0647/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1573177998"
    },
    {
      "title": "Terry Bogard, Top Games of the 2010s and Fortnite.",
      "description": "Terry Bogard has finally gone live for Super Smash Brothers Ultimate and Norris can’t talk about anything else. So we talk about our favorite DLC’s of all time. Plus, we bring you another list and this time we’re looking at the top 25 games of the 2010s courtesy of Polygon. Finally, we’re joined by Weird Beard to talk about how Chapter 2 of Fornite and the inclusion of bots has changed the game for the worse.",
      "pubDate": "Thu, 07 Nov 2019 04:02:18 +0000",
      "length": "14410593",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/c4fbee0c-0bce-47c7-81bf-aafe004187f0/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1573099364"
    },
    {
      "title": "Twitch Loses Another and Overwatch World Cup",
      "description": "Jack “CouRage” Dunlop joins the ranks of Ninja and Shroud as he signs an exclusive streaming deal outside of Twitch. CouRage, however, didn’t sign to Mixer but to YouTube. We cover this and other headlines from this past week in the gaming world. Plus, Team USA brought home the gold at Blizzcon 2019 as they defeat the power houses of South Korea and China earning their first Overwatch World Cup win. Finally, we asked our social media followers what games they have sitting on their shelves that they still intend on beating...one day.",
      "pubDate": "Wed, 06 Nov 2019 04:28:03 +0000",
      "length": "16530560",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/9127d7cd-e6e7-4dfe-a4d1-aafd0044d4bc/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1573014507"
    },
    {
      "title": "Call of Duty Brands Revealed and Ranked",
      "description": "The Call of Duty is all set to launch in early 2020. Activision Blizzard and the teams have revealed all team names and their brandings. We go through all 12 teams and decide if the branding is hot or not. Plus, we go over what we did this weekend which ranged from Anime Conventions to lying sick and dying in our beds. Joe also brings us another iteration of Checkpoint Goes to the Polls.",
      "pubDate": "Tue, 05 Nov 2019 03:11:45 +0000",
      "length": "20500651",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/62309f1d-7fb1-4524-9ca0-aafc003078ef/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572923534"
    },
    {
      "title": "Blizzcon 2019, Single Player and Riot feat Dr Amine Issa of Mobalytics",
      "description": "Blizzcon 2019 is officially underway and the opening ceremonies brought with it some major announcements. We talk about the unveiling of Diablo IV, World of Warcraft: Shadowlands, Hearthstone: Descent of Dragons and Overwatch 2. We also talk about the idea of whether or not the single player game is really dead. These past few months saw the release of some of the biggest titles of the year and they were all single player games. Plus, Robbie and Joe got to sit down with Dr. Amine Issa and talk with him about Riot Games and how Mobalytics helped with Legends of Runeterra.",
      "pubDate": "Sat, 02 Nov 2019 04:43:51 +0000",
      "length": "21684899",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/8bc7bdc4-ce82-405b-9f3b-aaf9004ce464/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572669860"
    },
    {
      "title": "Halloween, Overwatch and the PlayStation 4",
      "description": "It’s Halloween and we’re all dressed up in studio! We talk about what our plans for the weekend are and what we love (or hate) about Halloween. We also talk about the new format being used for this years Overwatch World Cup at Blizzcon 2019. We also preview some of the teams favored to win it all. Finally, the PlayStation 4 has become the second best selling console of all time and we talk about how it made it this far.",
      "pubDate": "Fri, 01 Nov 2019 00:54:25 +0000",
      "length": "16838114",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/fbe98d7d-eb1d-43f3-9d77-aaf8000e3e93/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572569702"
    },
    {
      "title": "Death Stranding, the 90s and EA.",
      "description": "Since leaving Konami and starting his own studio at Sony, Hideo Kojima’s hotly anticipated game Death Stranding is coming out on November 8th. The final trailer has been released and we talk about how much we know, which is still not a lot. Plus, Joe brings us a new list from the 90s and we’re going over the 25 best games of that era. Finally, EA and Steam have come back together to put EA games back on the launcher despite having their own launcher in EA Origins. Is this the beginning of the end of the Launcher Wars?",
      "pubDate": "Thu, 31 Oct 2019 00:52:01 +0000",
      "length": "14908192",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/afcccb6e-21a2-4bc5-bc62-aaf7000d1b63/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572483139"
    },
    {
      "title": "Call of Duty League and Getting Old",
      "description": "The eagerly anticipated Call of Duty League has finally got a start date and it’s going to be overlapping with just about every other major esports league. The League starts in January of 2020 and will take place over Friday through Sunday. We also cover other huge headlines in both the gaming and the esports world. Plus we asked our social media followers if they could do a perfect cosplay of any video game character for Halloween, who would they pick?",
      "pubDate": "Wed, 30 Oct 2019 02:03:42 +0000",
      "length": "16517963",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/d4a55ad6-f484-4198-95ef-aaf600207c4d/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572401048"
    },
    {
      "title": "Esports Hit SNL & Blizzcon is Coming!",
      "description": "As esports become more and more popular, mainstream media is starting to latch on. This past week Saturday Night Live did a skit where Chance the Rapper played a clueless NBA correspondent covering an esport event. Plus, with Blizzcon 2019 right around the corner we preview all the leaks and rumors flying around. We also talk about what we did over the weekend which was two things; The Outer Worlds and Call of Duty: Modern Warfare.",
      "pubDate": "Tue, 29 Oct 2019 01:15:52 +0000",
      "length": "16633652",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/5f7b2bd3-85ee-4bd5-9eed-aaf50013c90c/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572311777"
    },
    {
      "title": "Stadia, Creepy Monsters and the Weekend",
      "description": "Google’s Stadia is right around the corner and they’ve announced their first exclusive studio, Google Stadia and Entertainment in Montreal. Plus, build a list of the top creepiest creatures from video games and we preview the upcoming weekend.",
      "pubDate": "Sat, 26 Oct 2019 02:29:52 +0000",
      "length": "15336355",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/40823c3a-370d-459c-88dd-aaf20027f825/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1572057016"
    },
    {
      "title": "Mixer Strikes Again!",
      "description": "Massively multiplayer online games are considered a dying breed of game right now, but could the success to their future be in virtual reality? Also, there are two major Tv networks that are developing esports sitcoms, but is the mainstream tv world ready to accept it? Plus, Mixer has struck again stealing away one of Twitch’s top streamers. This time Shroud jumps ship, one of the most popular Call of Duty streamers and he does so on the day the new Call of Duty releases.",
      "pubDate": "Fri, 25 Oct 2019 00:54:31 +0000",
      "length": "14803990",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/035a0188-cf57-4ba2-903f-aaf1000e3910/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571964894"
    },
    {
      "title": "Bethesda, HBO and Black Holes",
      "description": "Fallout 76 has received no end of criticism since it’s launch nearly a year ago and it once again finds itself on the receiving end, both good and bad. We talk about the new Fallout 1st Premium Membership and more. Plus, Axios covered esports from the perspective of Blizzard and the Overwatch League 2019 Grand Finals. Finally, we asked our social media followers if they could throw any of their favorite games into a Fortnite style black hole and have it come out better...what game would they choose?",
      "pubDate": "Thu, 24 Oct 2019 00:36:19 +0000",
      "length": "13830349",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/664be04d-f8ac-45b8-a33f-aaf00008f320/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571877397"
    },
    {
      "title": "Star Wars, Riot and Wrestling!",
      "description": "Joe brings us the latest headlines hot from the news desk. In the world of gaming we’re starting to hear rumors of what Blizzcon 2020 may be unveiling, plus a new Batman Arkham game. In the esports world, it seems that Rick Fox’s troubles with Echo Fox may finally be coming to an end, plus we talk about the 7 new properties Riot Games has in development. Finally, the newest WWE game has been released and there isn’t a whole lot of good to talk about it, but there is a lot of bad.",
      "pubDate": "Wed, 23 Oct 2019 03:51:15 +0000",
      "length": "17765293",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/b21aaaff-25db-4f8c-b3db-aaef003e6eab/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571802705"
    },
    {
      "title": "The Great North American LoL Culling",
      "description": "League of Legends has been center stage in esports as group stages reach their conclusion for Worlds. Sadly, all three North American teams, Cloud 9, Team Liquid and Clutch Gaming all suffered disappointing losses and will not continue on to the World’s stage. We also take a look at what each of the hosts did over the weekend and take a look forward to November in gaming to see what game releases there are to get excited about.",
      "pubDate": "Tue, 22 Oct 2019 01:18:53 +0000",
      "length": "21603631",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/561b90b2-4e4f-4a24-a85b-aaee0013872f/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571707164"
    },
    {
      "title": "Easter Eggs and a Star Wars Intervention",
      "description": "Video Games have always been about exploration and finding hidden secrets or easter eggs. We talk about some of our favorite moments of personal discovery in games. Plus, Joe and Norris gives us the rundown on what’s happening in League of Legends Worlds and where the North American teams are at. Finally, Joe’s getting hyped about the new upcoming Star Wars game from EA and we need to have an intervention.",
      "pubDate": "Sat, 19 Oct 2019 01:30:40 +0000",
      "length": "13586914",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/fcf018cb-e14c-4daf-9bf6-aaeb0017f3dd/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571448657"
    },
    {
      "title": "Mobile Fears and Cosplay Mistakes",
      "description": "Kotaku put out a recent feature talking about some of the crazy lengths mobile game designers go to collect data from it’s users. Plus, a european cosplayer has her costume banned from a competition for doing black face. Finally, we debuted a new segment we’re calling Nailed It or Failed It.",
      "pubDate": "Fri, 18 Oct 2019 01:13:58 +0000",
      "length": "13482543",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/8bc13c1d-607b-4e33-b906-aaea00137528/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571361260"
    },
    {
      "title": "Riot versus the World & Player One, Mark Cooper",
      "description": "Riot Games is currently celebrating 10 years of League of Legends and boy, do they know how to celebrate. They’ve announced several new games in development including; a tactical shooter, a fighting game, a trading card game and mobile versions of both League of Legends and Team Fight Tactics. We also take a look at a list of the 20 scariest games of all time as created by Game’s Radar. Plus, we talk with Detroit-based rapper, Mark Cooper.",
      "pubDate": "Thu, 17 Oct 2019 02:29:24 +0000",
      "length": "15789115",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/3e3a633f-fc07-4022-be5d-aae90027787e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571279415"
    },
    {
      "title": "Fortnite Ends and 10 Years of League",
      "description": "The Internet was stunned earlier this week when Fortnite had seemingly ‘ended’ in a Black Hole sucking up the entire map. Eventually, when the game came back online, players were treated to Fortnite Chapter 2, the newest season that some players are saying feels like the early days of Fortnite. We also cover the biggest headlines in gaming and esports like the League of Legends 10th Anniversary and President Trump streaming his rally on Twitch.",
      "pubDate": "Wed, 16 Oct 2019 03:34:10 +0000",
      "length": "21549766",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7c2cff07-1537-449d-9a9d-aae800390cbd/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571272538"
    },
    {
      "title": "Blizzards Really Bad Year & Gaming's Mt Rushmore",
      "description": "It all started with the Diablo Mobile at Blizzcon 2018, included lay-offs, Activision CEOs, rumored sequels and now the Blitzchung suspension. Blizzard has not had the best year. Plus, if the gaming world had a Mount Rushmore who would you put on it? We also talk about the ballooning size of games and the hard drive space required to download it all.",
      "pubDate": "Tue, 15 Oct 2019 01:16:56 +0000",
      "length": "14847017",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/0795d287-9200-44c9-8ebf-aae70010e082/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1571102564"
    },
    {
      "title": "Trump on Twitch and Video Game Movies",
      "description": "Joining the likes of Bernie Sanders and the UK House of Lords, President Donald Trump aired his most recent rally on Twitch.tv. We talk about the possible future of politics on twitch and what that could mean. Plus, Robbie found a list of the top 10 worst video game movies of all time...and there are a lot of them. We also sit down with Sam Nelson of the Samination YouTube channel to talk to him about content creation and his love for games.",
      "pubDate": "Sat, 12 Oct 2019 01:23:53 +0000",
      "length": "21269118",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/03770d97-3d05-4cad-b4a8-aae40011ef9e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570843511"
    },
    {
      "title": "Boss Battles, Scares and Worlds, Oh my!",
      "description": "We talk about what makes a great boss battle theme song and we list some of the best of all time. We also talk about the horror genre and decide which medium does it better, movies or video games? And finally with League of Legends Worlds starting up, Norris and Joe decide their picks for whose going to make it all the way.",
      "pubDate": "Fri, 11 Oct 2019 01:12:43 +0000",
      "length": "16051310",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/75314872-a4a7-44e8-ac1b-aae300132148/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570756395"
    },
    {
      "title": "Our Holiday Wish Lists & Esports Goes Mainstream",
      "description": "Last year as we approached the Holiday season we decided to make a holiday wish list for the year. Today, we take a look back and see what came true and what didn’t. We also talk about where esports sits in the eyes of the mainstream media with Andy Miller, CEO of the San Francisco Shock appearing on Squawk Alley and Super and Sinatraa on Jimmy Fallon Tonight. Finally, we sit down with Nikola Piggott of the Story Mob about what it’s like as a PR firm within the esports industry.",
      "pubDate": "Thu, 10 Oct 2019 00:35:27 +0000",
      "length": "17478052",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/a0bb08cf-b95e-4ff8-9efc-aae200061d08/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570667749"
    },
    {
      "title": "Blizzard's Big Ban & Retro Refresh: Final Fantasy",
      "description": "A Hearthstone player in on stream voiced his support for Hong Kong’s liberation and as a result was banned and lost his winnings. It’s brought up an interesting conversation about politics place in esports. We also cover the biggest headlines coming out of the gaming scene and the esports industry. Plus, we debuted a new segment called ‘Retro Refresh’. Lastly, we check in with our social media following to ask what they think the spookiest game ever is!",
      "pubDate": "Wed, 09 Oct 2019 02:14:19 +0000",
      "length": "25591776",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/ce8a822f-aced-4924-96f7-aae1001ef63d/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570587296"
    },
    {
      "title": "The Fortnite Addiction & Social Media Misery",
      "description": "Epic Games the creators of Fortnite are being sued for knowingly creating a game that is as addictive as drugs. Also, after seeing the Joker movie and then participating in some annoying debates on social media, Robbie wished he had never seen it to begin with. This led us to ask, does Social Media just ruin everything? Plus, Joe brings us another list of the 30 best games of the decade!",
      "pubDate": "Tue, 08 Oct 2019 00:40:31 +0000",
      "length": "16355847",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/fa671443-340f-4cf8-94fb-aae0000962a0/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570495259"
    },
    {
      "title": "Playing Outside, Government in Esports",
      "description": "Technology has come so far and become so readily available and easy to use that children have access to tablets, smart phones, computers and consoles. Is the idea of going out to play becoming dated? Germany has introduced a new bill that could make them a future destination for esports athletes and streamers and caused us to ask what role governments should have in esports. Plus, we debut a new game called “Who Said It” where we pick out a quote from the Joker, Wilson Fisk or Donald Trump.",
      "pubDate": "Fri, 04 Oct 2019 01:37:34 +0000",
      "length": "15362306",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/44df36d8-f2bb-4312-9533-aadc0019b66f/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570153114"
    },
    {
      "title": "Wednesday, October 2nd 2019",
      "description": "We start off today talking about a recent patent from Sony that’s come to light. It got us thinking about what kinds of innovations we’d like to see in the next generation of gaming. Plus, Joe found a list that goes back to 1971 naming the most popular games for each year. We also got a chance to talk to Grizzly Mug about their documentary “Against the Odds” which follows the story of OG’s triumphant win at The International 2018.",
      "pubDate": "Thu, 03 Oct 2019 03:40:45 +0000",
      "length": "16417717",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/23cd5546-3d20-4e5f-94ac-aadb00389465/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1570074076"
    },
    {
      "title": "Tuesday, October 1st 2019",
      "description": "Over the weekend Robbie got to attend the Overwatch League Grand Finals and Joe and Norris got to attend Twitchcon 2019, we break down each of those events. Plus, Joe walks us through some of the biggest headlines in gaming and esports including the return of Evil Geniuses to the LCS. Plus, we asked our social media followers what their biggest gaming lemon is, that is what’s the worst gaming purchase you’ve ever made!",
      "pubDate": "Wed, 02 Oct 2019 03:49:26 +0000",
      "length": "26594027",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/07a69594-ea06-4835-b16e-aada003194ed/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1569988202"
    },
    {
      "title": "Wednesday, September 25th 2019",
      "description": "This weekend will play host to Twitchcon 2019 and the Overwatch League Grand Finals. Norris and Nate are flying out to San Diego for Twitchcon while Robbie heads to Philly for the Grand Finals. Everyone talks about their plans while Joe has to stay at home and hold down the office. We also play a game of Spot the Fake where we compare traditional sports headlines to esports one and there’s always a fake. Plus, Luis Vuitton has inked a three year deal with Riot Games and League of Legends, could designer cosmetics be coming to gaming?",
      "pubDate": "Thu, 26 Sep 2019 21:25:02 +0000",
      "length": "15788311",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/efc20ddc-398d-415d-9e88-aad4015ebb22/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1569533124"
    },
    {
      "title": "Tuesday, September 24th 2019",
      "description": "Joe sits down at the news desk for the day to bring us the biggest headlines from the gaming industry such as the French Court's ruling that Steam must allow games to be sold. We also take a look at the big stories unfolding in the esports world including the Overwatch League Grand Finals and the road to Worlds for League of Legends. We also break down the latest State of Play from Sony, including a release for one of the most anticipated games of 2020, The Last of Us 2.",
      "pubDate": "Wed, 25 Sep 2019 02:35:08 +0000",
      "length": "16163408",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7c952c30-fae1-400d-959a-aad300236365/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1569378929"
    },
    {
      "title": "Monday, September 23rd 2019",
      "description": "With some busy weekends coming up, we take the time to talk about what we’ve been doing in the limited amount of free time we’ve had. We also take a look at CNET’s list of 15 Games That Won’t Rot Your Kids Brains, spoilers, no game does that. We also asked our social media followers what game they’d like to see re-imagined the way Final Fantasy 7 is being completely remade. We go through your answers and give a few of our own.",
      "pubDate": "Tue, 24 Sep 2019 02:35:24 +0000",
      "length": "20563169",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/9c15a2d2-304d-4aee-a1d3-aad2001e9f8c/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1569292569"
    },
    {
      "title": "Friday, September 20th 2019",
      "description": "As more and more games are made availible through subscription services or digital downloads, does it make sense to pay full price for something you dont really own? And at what point will an esports athlete or streamer become so well known they reach true celebrity status? Joe also brings us a list courtesy of The Guardian boasting the top 50 games of the Century.",
      "pubDate": "Sat, 21 Sep 2019 01:59:11 +0000",
      "length": "15406620",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/a10db691-7e36-4676-aca7-aacf001af486/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1569031172"
    },
    {
      "title": "Thursday, September 19th 2019",
      "description": "Red Bull Gaming put out a documentary about OG in DOTA2 and it’s got us asking why there aren’t more films and series about esports. What other stories from esports history deserve to be told? Joe also brings another round of the Better Bargain to the show. Plus, we look ahead to see what games are coming out next month that we should be getting excited about.",
      "pubDate": "Fri, 20 Sep 2019 01:30:18 +0000",
      "length": "13689341",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/cec6b946-afc5-4acb-8d94-aace0016c12b/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568943063"
    },
    {
      "title": "Wednesday, September 18th 2019",
      "description": "PlayVS is a program that’s helping to tackle High School Esports and they’re set to do a phenomenal job at doing so. With season one set to start in October, over 13,000 schools are on the waitlist. For comparison, 14,600 schools participate in football programs. We talk about the impact esports could have on High Schools. Plus, we talk about the idea of using Virtual Reality to help promote healthier living. Finally, could E3 be looking to shift their focus to being a fan and influencer festival?",
      "pubDate": "Thu, 19 Sep 2019 03:06:09 +0000",
      "length": "15118835",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/60287b0c-4eec-449e-b339-aacd0031791c/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568862410"
    },
    {
      "title": "Tuesday, September 17th 2019",
      "description": "On today's show we visit Joe at the newsdesk to get the latest headlines in the gaming and esports industries. Like Ash Ketchum finally winning a League Championship title in the anime. Or the controversy surrounding the esports scene in Japan where a Street Fighter V winner gave up most of his winnings in protest of JeSU rules. Plus we ask our social media following what SNES game they’d love to be able to play anywhere, anytime.",
      "pubDate": "Wed, 18 Sep 2019 03:24:32 +0000",
      "length": "16506390",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/dd66056c-94a3-402e-b714-aacc0021f686/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568777098"
    },
    {
      "title": "Monday, September 16th 2019",
      "description": "With Joe and Norris back in studio, we start by playing catch up with the news out of the Tokyo Game Show. We also talk about the Call of Duty esports scene now that all the franchise slots have been announced. We also talk about how games are becoming increasingly more realistic gameplay wise.",
      "pubDate": "Tue, 17 Sep 2019 01:49:05 +0000",
      "length": "15358009",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/b2ceea3b-2dd4-4198-bb4a-aacb001a30f3/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568684965"
    },
    {
      "title": "Friday, September 13th 2019 Live from Esports Business Summit 2019",
      "description": "The Esports Business Summit may be wrapped up and done, but we've still got tons of content from it. Joe and Norris talk about the LCS Gauntlet tournament. Plus, they get a chance to sit down with Matt Edelman of Super League Gaming and Felix Lahaye the CEO of United Esports.",
      "pubDate": "Sat, 14 Sep 2019 01:19:44 +0000",
      "length": "19598455",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/e45c1c23-0e8d-4204-99a1-aac8000dc5a4/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568424008"
    },
    {
      "title": "Thursday, September 12th 2019 Live from The Esports Business Summit 2019",
      "description": "At their final day at the Esports Business Summit, Joe and Norris bring us interviews with; Zach Wigal the founder of the charity Gamer's Outreach, Matt Archambault from Riot Games, Podcast host Lisa Foils from '...and a bag of chips!\" and Joshua Kell the CEO of Horizon AVL.",
      "pubDate": "Thu, 12 Sep 2019 23:53:27 +0000",
      "length": "29538765",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/87351ba9-c82d-4b65-bae8-aac60182c904/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568332458"
    },
    {
      "title": "Wednesday, September 11th 2019 Live from the Esports Business Summit 2019",
      "description": "For Day 2 at the Esports Business Summit Joe and Norris got to talk to several key players behind major organizations making the industry tick. Including; Bennett Newsome the Esports Strategist for Full Sail University, Mark Deppe the Director of Esports at UCI, Colin Smith the President of 704 Games, Justin Dellario the Head of Twitch Esports and Victoria Horsley the Head of Marketing for NACE.",
      "pubDate": "Thu, 12 Sep 2019 02:29:22 +0000",
      "length": "32430148",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/71273251-4a1e-407a-b2d2-aac60026cd5e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568255420"
    },
    {
      "title": "Tuesday, September 10th 2019 Live From the Esports Business Summit 2019",
      "description": "For Day 1 of the Esports Business Summit, Joe and Norris start off talking about some of the changes to the Esports Business Summit from last year. They also sit down with Megan Kucynski, Managing Director of the Esports Business Summit. They also have a chance to speak with Jacob \"PR\" Arce, a Gears of War 5 Caster. Finally, they talk about the newest edition to the Beasley XP and Checkpoint XP family, Checkpoint XP On Campus.",
      "pubDate": "Wed, 11 Sep 2019 01:18:21 +0000",
      "length": "20276558",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/8c038ec6-ddff-4a2e-9109-aac50013a8f5/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568164730"
    },
    {
      "title": "Monday, September 9th 2019 feat Chuck Bean of Nerd Radio & Pauly Esther, Content Creator for Dead By Daylight",
      "description": "Norris and Joe are out of the studio this week for the Esports Business Summit, so we’re joined by Chuck Bean of Nerd Radio. We catch up with Chuck about how he’s living the Checkpoint XP Studios and what he’s been doing recently. We also preview several categories of the Tempest Awards, set to take place at the Esports Business Awards. You can catch the Tempest Awards exclusively on the Checkpoint XP Twitch Channel on Tuesday, September 10th at 8:45 pm EST. We also sit down with Paulie Esther, a content creator for Dead by Daylight. We also get a chance to speak with two players from Ghost Gaming about Gears of War 5’s competitive scene.",
      "pubDate": "Tue, 10 Sep 2019 01:26:45 +0000",
      "length": "29264478",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/fa71c306-1964-4239-a37f-aac400162c52/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1568078847"
    },
    {
      "title": "Friday, September 6th 2019",
      "description": "The Overwatch League is one of the few esports scenes using traditional Nielsen Metrics to track their viewers, something that’s been a book for them when competing for non-endemic sponsorship. We talk about how this has affected their success and what it could mean for the future. Norris also hosts a game of his creation called ‘Who Dat Character?’ Plus, we asked our social media what their favorite video game sequence is.",
      "pubDate": "Sat, 07 Sep 2019 02:58:59 +0000",
      "length": "15058396",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/fd2b6cb0-a30d-49cf-b1c6-aac1001c9081/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1567825159"
    },
    {
      "title": "Thursday, September 5th 2019",
      "description": "Nintendo dropped another Direct the other day and it was a big one. Overwatch on the Switch, Smash DLC characters, SNES virtual console and much more! Plus, with the Tokyo Game Show just around the corner, we talk about what we’re likely to see and what we’re most excited about. Joe also has another round of Spot the Fake for us.",
      "pubDate": "Fri, 06 Sep 2019 01:19:07 +0000",
      "length": "16127034",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/5ff76365-d27d-4ce3-b8c2-aac00014369a/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1567732778"
    },
    {
      "title": "Wednesday, September 4th 2019 feat Ric \"Weird Beard\" Hogerheide",
      "description": "Counter-Strike is one of the oldest esports scenes in the industry and has always operated a bit differently from leagues like Overwatch or League of Legend. Dreamhack and the ESL are teaming up to form the CS:GO Open Circuit. We also talk about the launch of World of Warcraft Classic and if the popularity of the launch could actually be evidence of the end for the MMO genre. Plus, the United Kingdom’s Parliament has a twitch channel, you read that right, the House of Lords and the House of Commons is on Twitch.",
      "pubDate": "Thu, 05 Sep 2019 02:36:03 +0000",
      "length": "15191463",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/3b5a80ff-b969-40f1-9ea2-aabf0029bb80/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1567650991"
    },
    {
      "title": "Tuesday, September 3rd 2019",
      "description": "Joe brings us the latest headlines from the gaming world including; Blizzard developing Overwatch 2, 300k people watching World of Warcraft Classic and many others. We also check in on the biggest headlines from the esports industry such as 100 Thieves passing on the Call of the Duty league, the Overwatch League play-in stage results and ESL and Dreamhack Open Circuit. Plus, what did the crew get up to over the Labor Day weekend? We also asked our social media followers what their favorite line from a video game is.",
      "pubDate": "Wed, 04 Sep 2019 02:32:07 +0000",
      "length": "22022850",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/1fae0915-017d-4240-a5a7-aabe00285f57/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1567564366"
    },
    {
      "title": "Thursday, August 29th 2019",
      "description": "Last year the studio behind popular games like The Wolf Among Us or The Walking Dead, TellTale Games suddenly went bankrupt leaving fans and employees alike confused, heartbroken and with more questions than answers. Well, now it’s back but under completely new management. We also talk about esports organization 100 Thieves choosing not to enter the Call of Duty League. Plus, a list of the 15 best dogs in gaming. Who is the goodest boys?",
      "pubDate": "Fri, 30 Aug 2019 03:53:53 +0000",
      "length": "13507580",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/e4e626b8-3d1a-4eee-8979-aab9003f121f/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1567137263"
    },
    {
      "title": "Wednesday, August 28th 2019 feat ONEshotGURL",
      "description": "Nate brings us a video from Unilad that shows a 15 year old boy being arrested for making threats online, his mother argues they were jokes he heard playing games. We talk about taking responsibility for both our actions and inactions in the gaming space. We also discuss Complexity dropping their entire DOTA2 roster following The International 2019 and why it’s a bad look for esports. Finally, we are joined by popular streamer ONE_shot_GURL to talk about her streaming, history and of course, Fortnite.",
      "pubDate": "Thu, 29 Aug 2019 00:28:33 +0000",
      "length": "15287293",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/a25cb513-23b3-4a69-9338-aab80005d1aa/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1567038533"
    },
    {
      "title": "Tuesday, August 27th 2019",
      "description": "This week in the gaming world we talk about headlines such as Sony purchasing Insomniac Games, the Mortal Kombat movie’s casting, Star Citizen and their crazy ship prices and more. On the esports side of things we talk about OG winning their second International in DOTA2, Complexity dropping their entire DOTA2 line-up, the finalized roster for the Team USA Overwatch World Cup and much more. Plus, our social media question this month courtesy of Fred B, what’s the best video game weapon of all time?",
      "pubDate": "Wed, 28 Aug 2019 01:47:49 +0000",
      "length": "16582269",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/18c76b2d-ecdd-4bff-9ef0-aab7001cc928/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566956913"
    },
    {
      "title": "Monday, August 26th 2019",
      "description": "Over the weekend Riot Games and League of Legends visited Detroit MI for the LCS Summer Split. The crew talk about their experiences at the event and how it stacks up to other live events. Plus, Rick Fox and League of Legends are taking center stage on HBO’s Ballers, which stars The Rock as a Sports Agents. The crew discuss how esports are portrayed in the program and how it could end up playing out throughout the rest of the season. The Checkpoint Crew also introduces Chadd, one of the newest members of the Checkpoint XP team.",
      "pubDate": "Tue, 27 Aug 2019 02:00:11 +0000",
      "length": "21651266",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/6045fa6b-2b89-456d-9d64-aab600116d94/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566871280"
    },
    {
      "title": "Friday, August 23rd 2019 feat Devin Murphy, Riot Games & Noah Smith, Washington Post",
      "description": "This weekend is playing host to the LCS Summer Split Finals in Detroit, Michigan. We’re joined first by Devin Murphy of the LCS as he talks to about what it takes to put on an event as big as the LCS Summer Split Finals. We also bring in Noah Smith, contributing writer for the Washington Post to talk to him about a recent story of his. He also joins us to talk about the LCS Summer Split Finals and joins Joe and Norris for their preview of the event.",
      "pubDate": "Sat, 24 Aug 2019 01:29:26 +0000",
      "length": "22778134",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/d2000e97-a0b7-45bd-a92f-aab300155e95/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566610197"
    },
    {
      "title": "Thursday, August 22nd 2019 feat Genie Doi of ESG Law",
      "description": "With the success of World of Warcraft Classic, we have to ask the burning question...could anyone else get away with it? Could other MMOs stand to create specialized servers for various era’s of their games? Plus, Joe brings us a new list, this time we’re talking about the top 10 video game weapons of all time. We’re also joined by a special guest, Genie Doi of ESG Law, to talk about a bill that if passed would severely affect the esports ecosystem as we know it.",
      "pubDate": "Fri, 23 Aug 2019 01:29:44 +0000",
      "length": "18289678",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/c431997c-b00a-4580-affa-aab200172992/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566523847"
    },
    {
      "title": "Wednesday, August 21st 2019 feat Bryan Reedy of Gamer Advantage",
      "description": "We are joined by special guest and friend of the show Bryan Reedy aka Mr Advantage of Gamer Advantage. He joins us to talk about the huge announcements and reveals out of Gamescom 2019 in Germany, including Death Stranding from Hideo Kojima and Square Enix’s Final Fantasy VIII Remaster. Joe also subjects to another one of his games, this time it’s Spot the Fake. Finally, the geek and nerd world was shook to its core as rumors began to spread about Sony pulling Spider-Man from Marvel, leaving us wondering what that means for the future of the Marvel Cinematic Universe.",
      "pubDate": "Thu, 22 Aug 2019 02:10:52 +0000",
      "length": "17556037",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/900e2808-8fb7-4345-b66b-aab100227da8/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566439880"
    },
    {
      "title": "Tuesday, August 20th 2019",
      "description": "Some fans at the International this year complained that the crowd was too quiet when non-Chinese teams were on the stage and too loud when the Chinese teams were on the stage. Do esports fans not know how sports work? We also talk about what the 2020 Overwatch League Schedule is going to look like because it’s a far cry from what we’ve been used to with the introduction of home and away games. Plus, we talk about some of the lesser known games coming out of Gamescom this year and what we’re looking forward too.",
      "pubDate": "Wed, 21 Aug 2019 14:48:43 +0000",
      "length": "16192829",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/bfcf8fff-a1b9-4b95-b586-aab000f30394/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566398943"
    },
    {
      "title": "Monday, August 19th 2019",
      "description": "On today’s show we see what the guys got up to over the weekend. We also check in with Joe at the news desk to cover some of the biggest headlines in esports and gaming, such as the LCS Semifinals results and Bioware losing two of it’s lead developers. We also asked our social media follows if there was a single video game food item they could eat, what would it be and why?",
      "pubDate": "Tue, 20 Aug 2019 02:38:04 +0000",
      "length": "23828420",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/5872f384-18e4-40ec-8b14-aaaf002a378b/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566268722"
    },
    {
      "title": "Friday, August 16th 2019",
      "description": "Gamescom 2019 is right around the corner and being one of the biggest video game shows of the year we have to preview it and provide some of our own predictions. Norris also takes us through some major difficulties and controversies the Fighting Game Community has been dealing with lately. Plus, we preview what's coming up this weekend in the esports scene.",
      "pubDate": "Sat, 17 Aug 2019 01:49:25 +0000",
      "length": "16509737",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/43481a60-60a4-4815-ab9f-aaac001b4575/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1566006586"
    },
    {
      "title": "Thursday, August 15th 2019",
      "description": "The tragic story of Echo Fox and the tenth LCS Franchise Slot is coming to an end. With the deal between Echo Fox and Kroenke Esports fall apart, Riot has now taken over the responsibility of selling the slot in the NA LCS. They will soon open for applications over a 30 day period. Plus, Ford has announced they will be entering into the esports space in a meaningful way and are making their big announcement at Gamescom in Europe. Joe also brings back a classic game to the Checkpoint XP crew, it’s Name That Price! This time, he’s drawing from Denver, Colorado.",
      "pubDate": "Fri, 16 Aug 2019 01:21:00 +0000",
      "length": "14038773",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7d251afd-c2cc-4b06-b9d4-aaab00154d96/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565918487"
    },
    {
      "title": "Wednesday, August 14th 2019",
      "description": "As we near September, we’re coming to the time of the year where all the great, new games are slated to release. We talk about which games we are most excited for; Control, Borderlands 3, Link's Awakening, Death Stranding or Pokemon Sword and Shield...just to name a few. We also talk about the games that are just way too long to replay through, looking at you Persona 5. Joe also poses a question for us, will we ever look at video games the same way we look at literature? Or are we already there?",
      "pubDate": "Thu, 15 Aug 2019 01:14:21 +0000",
      "length": "16557706",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/306f3ea1-a4d2-4d3d-82ac-aaaa00134373/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565831689"
    },
    {
      "title": "Tuesday, August 13th 2019",
      "description": "We start today talking about the biggest movements in the biggest leagues like the PUBG World Cup, The Overwatch League and the North American LCS, including a visit from caster Azael. We also go over the recent headlines in the gaming world and esports scenes including how recent Fortnite World Cup winner Bhuga got swatted while on stream. We also ask our social media follows how gaming has changed their lives.",
      "pubDate": "Wed, 14 Aug 2019 02:25:12 +0000",
      "length": "22157640",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/4f53f49d-72e1-4250-9306-aaa90025788d/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565749554"
    },
    {
      "title": "Monday, August 12th 2019",
      "description": "Last week streaming megastar Ninja left Twitch for Microsoft’s streaming platform Mixer. In the midst of his departure Twitch changed his streaming off-line page to suggest other top streamers in the Fortnite category. Over the weekend an account streaming pornographic content became number one in the category with 20,000 viewers which showed up on Ninja’s page. The streamer was of course, no happy and everyone has an opinion on it. We also talk about what we did over the weekend and Joe brings us a list of the top 25 mascots in video games.",
      "pubDate": "Tue, 13 Aug 2019 01:37:24 +0000",
      "length": "20156568",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/0f86a237-d252-47c4-b68f-aaa800138c8c/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565660280"
    },
    {
      "title": "Friday, August 9th 2019 feat ShowYouSuck",
      "description": "We speak with Chicago based rapper, ShowYouSuck, who has made a name for himself in the video game world with music inspired by the games he loves. We also talk about a YouTuber who allegedly had private investigators show at his home from 2K games to ask him about the content he had been putting on his channel pertaining to Borderlands 3. Plus, ESPN and Walmart both react to the mass shootings in El Paso, Texas and Dayton, Ohio by removing video games from their schedule and store, respectively.",
      "pubDate": "Sat, 10 Aug 2019 00:34:50 +0000",
      "length": "17246313",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7feb19d2-2a3e-4777-9714-aaa500083b01/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565397320"
    },
    {
      "title": "Thursday, August 8th 2019 feat Azael, Riot Games Caster",
      "description": "With the LCS Summer Split Finals coming to Detroit MI in just a few short weeks, we talk with caster Azael about what we should expect from the competition. We’re big fans of lists at Checkpoint XP and any chance we get to make ‘em or break ‘em, we take. On today’s show we bring you a list from GameSpot of the most influential games of the 21st Century, the games that changed everything! Will it pass the Checkpoint? We also talk about how cheesy and ‘cringe’ some esports moments can be. Is that really a bad thing though? Should esports give up entirely on trying to market itself the way sports does in the mainstream or lean into the fact that we’re all nerds and this is just what we do. Plus, is the current model of video game development sustainable long time? And if it isn’t how long until the bubble pops?",
      "pubDate": "Fri, 09 Aug 2019 03:20:02 +0000",
      "length": "22129214",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/4b4c7373-2566-441d-bb78-aaa40034c719/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565320846"
    },
    {
      "title": "Wednesday, August 7th 2019",
      "description": "The ESA released a statement this week about their efforts and intentions to properly rate and inform consumers about the contents and chances of receiving said content in loot boxes. Several developers have also pledged to change the way they handle loot boxes as well. We also ask ourselves, if you could go back in time and tell yourself something about the future of gaming, what would it be? We each pick something to troll about, warn about and give hope for. Plus, the guys talk about the most recent Smackdown event held in Detroit.",
      "pubDate": "Thu, 08 Aug 2019 03:51:53 +0000",
      "length": "20497128",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/07ce8ca3-60c5-4842-81d2-aaa3003e9685/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565236336"
    },
    {
      "title": "Tuesday, August 6th 2019",
      "description": "Following two mass shootings this weekend in Dayton, OH and El Paso, TX, the media has been quick to throw the blame at the feed of the gaming industry. Several large political figures including the President were part of the chorus of people decrying video games for their violence. We talk about the way video games are consistently and negatively portrayed in the media. We also catch up with Sarahscopic for the biggest news headlines out of the gaming and esports industries. Plus, we asked our social media followers what the worst mini game or side quest in gaming is and we’ll read the best answers.",
      "pubDate": "Wed, 07 Aug 2019 05:59:49 +0000",
      "length": "22229322",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/f4a54cab-dc0e-49a0-bd6e-aaa2003072ce/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565157658"
    },
    {
      "title": "Monday, August 5th 2019",
      "description": "We start off monday as always, talking about our weekend. One of the hosts has some big, life-changing news to share with the rest of the crew. As for the rest of them, the majority of the weekend was spent following the media and news cycle as the ‘video games are to blame for mass shootings and violence’ argument is once again brought to the forefront. During the weekend we also saw the biggest fighting game tournament of the year, EVO 19, as competitors faced off in some of the biggest titles in all of esports including, Super Smash Brothers Ultimate, Street Fighter V, Tekken 7, Mortal Kombat 11 and others. Plus, streaming megastar Ninja has abandoned Twitch and signed an exclusive streaming deal with Mixer.",
      "pubDate": "Tue, 06 Aug 2019 03:35:08 +0000",
      "length": "20292881",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/e77e1c0e-b094-4192-a0b6-aaa10039286a/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1565062567"
    },
    {
      "title": "Friday, August 2nd 2019 feat Justin Wong, EVO Competitor & FGC Legend",
      "description": "The ongoing feud between Turner ‘Tfue’ Tenney and FaZe Clan has had another interesting turn of events. Last month Tfue left FaZe clan amidst various claims including unfair contracts. The story has been quite for a few weeks now but FaZe Clan is now counter suing Tfue for ‘breach of contract’ claiming “you betrayed us.” Meanwhile, across the pond at FarmCon 2019 the Farming Simulator League has held its first tournament and it’s unlike anything else esports has seen before. Plus, while out at EVO 2019 host of Not Your Player 2, Christine “Kooky” Solis got to interview the legendary Justin Wong.",
      "pubDate": "Sat, 03 Aug 2019 01:06:09 +0000",
      "length": "17438263",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7f992266-9c3d-4f5d-a950-aa9e000cd1f8/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564794392"
    },
    {
      "title": "Thursday, August 1st 2019",
      "description": "Ninja is a name that everyone knows, even if you’re not a gamer you’ve likely heard of the blue haired streaming sensation. Today he announced he’s leaving Twitch to stream exclusively for Mixer. Plus, the Game Boy is one of the most important consoles of all time. Nate, Norris and Robbie talk about what the handheld meant to them and how it continues to influence gaming today. Norris also leads a game on just how well Robbie and Nate know some of their favorite games and characters by guessing who they are based on famous quotes.",
      "pubDate": "Fri, 02 Aug 2019 02:10:35 +0000",
      "length": "15056672",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/c9da4bb5-d47c-44c8-ab89-aa9d001fe862/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564711863"
    },
    {
      "title": "Wednesday, July 31st 2019",
      "description": "As Echo Fox is set to sell off their slot in the LCS, Rick Fox has opened up in an interview shedding more light on how the whole situation came to be. Statements from both Rick Fox and Amit Raizada paint a conflicting picture. We also check in on the latest league updates with League of Legends as they near the Summer Split and the Overwatch League as they enter Stage 4 with the new 2-2-2 Role Lock. Plus, Jack “Script” Ross, a caster from FGC Smash scene joins us to talk about EVO 2019 and what we should expect.",
      "pubDate": "Thu, 01 Aug 2019 02:23:52 +0000",
      "length": "14958729",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/4f091d62-12ca-477c-a9bb-aa9c00263c06/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564626251"
    },
    {
      "title": "Tuesday, July 30th 2019",
      "description": "On today’s show we have Sarahscopic join us at the news desk to break down some of the biggest headlines in the industry this week. Including; Overwatch’s in-game microtransactions breaking $1 Billions, Dying Light 2 being confirmed as a cross generation game for the Playstation 4 and 5 and the XBox One X and Scarlet and the Doom Trilogy releasing on the Nintendo Switch. We also check in with our Social Media following and ask them what the best mini-games in a video are.",
      "pubDate": "Wed, 31 Jul 2019 04:07:15 +0000",
      "length": "16268185",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/f8e1d4ca-83b5-47ca-a7af-aa9b0042b239/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564546091"
    },
    {
      "title": "Monday, July 29th 2019",
      "description": "This weekend played host to the first ever Fortnite World Cup, where winners walked away with upwards of $1 Million each. We also talk about what we did over the weekend which involved Fire Emblem, Fortnite and...roofing? We also talk about games that aren’t played the way developers intended them to be.",
      "pubDate": "Tue, 30 Jul 2019 03:02:26 +0000",
      "length": "19286220",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/661b2a6f-8f37-48d0-9a8b-aa9a002c768e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564455779"
    },
    {
      "title": "Friday, July 26th 2019",
      "description": "According to a story on Kotaku, 74% of adults say they’ve been harassed online as gamers. We dig into the study and discuss some of the results. Plus, what games do you know are dumb but love to play anyway? We also choose what our perfect gaming squad would look like if we could draft heroes from any FPS or Third Person Shooter game.",
      "pubDate": "Sat, 27 Jul 2019 03:27:45 +0000",
      "length": "14575464",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/1f21a294-1ec5-47b8-8549-aa970032509e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564198085"
    },
    {
      "title": "Thursday, July 25th 2019 feat Tommy Tallarico of Video Games Live",
      "description": "This past week Joe got to attend Video Games Live Concert and talk to Tommy Tallarico. We also talk about what it might look like if Disney were to buy into the video game space and what that would look like. Plus, GTA Online releases their Diamond Casino and more than 50 countries don’t have access to it.",
      "pubDate": "Fri, 26 Jul 2019 01:45:32 +0000",
      "length": "18405175",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/091de191-ef07-424e-9d43-aa96001a578d/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564105561"
    },
    {
      "title": "Wednesday, July 24th 2019",
      "description": "We bring you updates for some of the biggest leagues including League of Legends, PUBG, Overwatch League and CS:GO with friend of the show, Weird Beard. We’ll also cover the recent happenings in regards to Echo Fox and the LCS. Plus, we asked you what your favorite developer could do to mess up your favorite game and voice of the people, Sarahscopic reads your responses.",
      "pubDate": "Thu, 25 Jul 2019 01:52:21 +0000",
      "length": "14001875",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/36cf8350-cde2-44f1-bcbe-aa95001df564/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1564019572"
    },
    {
      "title": "Tuesday, July 23rd 2019",
      "description": "We start with an interview with Steve Wiseman of First Blood. Plus we’re joined by Sarahscopic at the news desk for an update in the biggest headlines from this weeks Gaming and Esports scenes. Lastly, we talk about some of the worst 90s fads and which ones we’re guilty of perpetuating.",
      "pubDate": "Wed, 24 Jul 2019 01:56:26 +0000",
      "length": "23179520",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/d01caba8-d45d-4b14-8717-aa94001a6b1e/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563933455"
    },
    {
      "title": "Monday, July 22nd 2019",
      "description": "This weekend was San Diego Comic-Con and Marvel unveiled all it’s plans for Phase 4 which included tons of new properties. We also discuss what we did over the weekend beside avoiding the 100 degree heat. We also talk about the idea of developers shadow patching games and why it needs to make a comeback.",
      "pubDate": "Tue, 23 Jul 2019 01:01:18 +0000",
      "length": "17093212",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/29861a66-2540-4472-9673-aa93000f8490/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563843699"
    },
    {
      "title": "Friday, July 19th 2019",
      "description": "With the release of the Cats movie trailer, we were all beyond creeped out and decided to talk about other creepy movies. Plus, Joe brings us a story about Gamer Churches in discord? We also talk about what we’d like to see from Marvel out of San Diego Comic Con.",
      "pubDate": "Sat, 20 Jul 2019 02:38:34 +0000",
      "length": "24458338",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/f719b809-9a9f-48a6-88fa-aa90002764f3/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563590347"
    },
    {
      "title": "Thursday, July 18th 2019",
      "description": "With the major heatwave about to hit most of the US, we talk about the best games to play while stuck inside. We also discuss the finer points of esports footwear and Joe has another list...this time about the best looking consoles ever.",
      "pubDate": "Fri, 19 Jul 2019 01:03:13 +0000",
      "length": "17254972",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/ad18d8b2-0a04-4a35-ba79-aa8f000abc72/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563498253"
    },
    {
      "title": "Wednesday, July 17th 2019",
      "description": "Our good friend Gello joins us to discuss the idea of hiring an esports coach for your kids. We also talk about the first time an MMO really inspired awe in us and what it would take to do that again. Plus, we asked our social media followers what their food to snack on while gaming is.",
      "pubDate": "Thu, 18 Jul 2019 01:34:21 +0000",
      "length": "19394915",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/5faa0f8c-500f-4ce2-be0a-aa8e0018b9cd/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563413699"
    },
    {
      "title": "Tuesday, July 16th 2019",
      "description": "Sarahscopic is back at the news desk with the latest in esports and gaming, including what the future of the OWL will look like. We also check in on whats happening with the LCS and you'll never guess which OWL team just won the Stage 3 Championship.",
      "pubDate": "Wed, 17 Jul 2019 03:59:40 +0000",
      "length": "16490660",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/575577f8-290a-45cb-95b8-aa8d0024bfa9/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563336181"
    },
    {
      "title": "Monday, July 15th 2019",
      "description": "After a much needed weekend, the guys return and let us know what they got up to. Plus, Google is implementing their Deep Mind AI into Starcraft. We also ask, how long is too long when it comes to committing time to a single game?",
      "pubDate": "Tue, 16 Jul 2019 01:24:52 +0000",
      "length": "19584460",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/52967283-bd35-4b01-9487-aa8c0013ace0/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1563240326"
    },
    {
      "title": "Friday, July 12th 2019 feat Jon Vokel, Ric \"Weird Beard\" Hogerheide, & Noah Smith",
      "description": "We celebrate the final day of our grand studio opening with a bunch of guests; friend of the show Noah Smith of the Washington Post and Collegiate Overwatch Player of Northwood University, Jon Vokal. Ric \"Weird Beard\" Hogerheide also sits down with us in studio to talk about a hopeful 2020 presidential candidate, self-proclaimed gamer, Ace Watkins!",
      "pubDate": "Sat, 13 Jul 2019 02:10:31 +0000",
      "length": "30686735",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/f8b01187-d8d0-4bdd-9bea-aa890017d3c2/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562983894"
    },
    {
      "title": "Thursday, July 11th 2019 feat Jack \"Script\" Ross, FGC Commentator and Noah Smith, Washington Post Contributor",
      "description": "We had the pleasure of being joined today by Smash FGC Caster Jack “Script” Ross to talk about the FGC and Smash. Plus, Noah Smith of the Washington Post joined us to discuss an article he wrote about the current state of Esports Contracts in the industry. We also take a moment to discuss why ESPN and the ESPYs still don’t quite have esports right.",
      "pubDate": "Fri, 12 Jul 2019 00:51:30 +0000",
      "length": "21665843",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/239f24e1-bf55-452c-a74b-aa8800094d90/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562892721"
    },
    {
      "title": "Wednesday, July 10th 2019 feat Brian Reedy of Gamer Advantage",
      "description": "We are joined by Bryan Reedy of Gamer Advantage as we discuss Gamer Wellness. We also play a round of Name That Price courtesy of Las Vegas.",
      "pubDate": "Thu, 11 Jul 2019 01:25:03 +0000",
      "length": "28507448",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/7e4b291e-93d9-47ea-8809-aa870013eb97/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562808343"
    },
    {
      "title": "Tuesday, July 9th 2019",
      "description": "As Sarahscopic joins us at the new desk we cover the latest headlines in gaming and esports. Plus, we asked our followers if they've ever canceled plans to play a video game.",
      "pubDate": "Wed, 10 Jul 2019 01:54:46 +0000",
      "length": "16217829",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/1c40c9c5-4a46-4a5d-9e7a-aa86001b8cac/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562723767"
    },
    {
      "title": "Monday, July 8th 2019",
      "description": "Analysts are predicting the trade wars could effect console prices in the next gen. The guys also discuss what they did over the holiday weekend and we ask if games have ever affected your relationship.",
      "pubDate": "Tue, 09 Jul 2019 02:56:38 +0000",
      "length": "15477902",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/871da31d-df68-4930-9b5f-aa85002f4523/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562641018"
    },
    {
      "title": "Wednesday, July 3rd 2019",
      "description": "This year at CEO, AEW premiered FyterFest, we break all that down. We also take a look at all the league news from this past week. And to celebrate the 4th of July weekend we list the top 15 foods to eat at a BBQ.",
      "pubDate": "Thu, 04 Jul 2019 00:45:30 +0000",
      "length": "17326586",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/577d1bc6-d93f-4d97-905f-aa80000ba378/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562201158"
    },
    {
      "title": "Tuesday, July 2nd 2019",
      "description": "We're joined as usual on Tuesday by Sarahscopic as she leads us through the biggest headlines in gaming and esports. Plus, as the resident voice of the people she also brings us your answers to this weeks social media question.",
      "pubDate": "Wed, 03 Jul 2019 02:27:52 +0000",
      "length": "16466916",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/c4988868-1bea-4483-8885-aa7f002642cc/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562121027"
    },
    {
      "title": "Monday, July 1st 2019",
      "description": "Sony has announced its intentions to acquire more developers, something Microsoft has been doing for a few years. What does this mean for the future of games? Plus, we dial in on what the guys have been up to this past weekend and Joe has us try a new style of league updates.",
      "pubDate": "Tue, 02 Jul 2019 02:07:41 +0000",
      "length": "18422658",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/6044a36e-bfba-4b9d-99d1-aa7e0021f104/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1562033284"
    },
    {
      "title": "Friday, June 29th 2019 LIVE From GameTime in Auburn Hills, MI",
      "description": "Checkpoint XP is live from the opening of the brand new esports facility called GameTime in Auburn Hills, MI. GameTime is a bar and restaurant that is also the new home for The Renegades esports team. Join us as the Checkpoint XP crew shares their reactions to being in this state of the art facility for the first time. The crew also gets to sit down with James from the Dave and Chuck The Freak morning show of 101 WRIF, Brian from Gamer Advantage and FGC caster Script!",
      "pubDate": "Sat, 29 Jun 2019 05:22:36 +0000",
      "length": "95899356",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/5c0aaa24-9c25-40c6-a547-aa7b00567baa/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561785900"
    },
    {
      "title": "Thursday, June 27th 2019",
      "description": "Joe brings us some of the latest headlines in gaming and esports. We also discuss Dr Disrespects return to twitch and why its problematic. Plus, Netflix is adapting Final Fantasy to live action.",
      "pubDate": "Fri, 28 Jun 2019 01:32:25 +0000",
      "length": "15629131",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/3aa64755-a80c-48bf-9f6c-aa7a00185012/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561685565"
    },
    {
      "title": "Wednesday, June 26th 2019",
      "description": "It's been a crazy week in the LCS, NPL and OWL. We also sit down with Zen - a Rocket League player with The Renegades and check out the Renegades new GameTime facility. Plus, we find out what your favorite esports moment of all time is!",
      "pubDate": "Thu, 27 Jun 2019 02:58:12 +0000",
      "length": "15116574",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/578fc8a8-666e-4205-a012-aa79002e4335/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561604310"
    },
    {
      "title": "Tuesday, June 25th 2019",
      "description": "We breakdown the latest headlines coming out of the esports and gaming industry. Including the ESPYs introducing an esports category and Microsoft's cloud gaming platform, xCloud.",
      "pubDate": "Wed, 26 Jun 2019 00:06:55 +0000",
      "length": "11882039",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/858cc335-070d-4848-89f2-aa7800011b4f/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561507666"
    },
    {
      "title": "Monday, June 24th 2019",
      "description": "Due to some recent Epic Games news, Joe poses the question of if they're entering a redemption arc, but we wonder if they even have anything to redeem? Plus, what did the guys get up to over the weekend. We also try out a new segment called 'Esports for your Dad!'",
      "pubDate": "Tue, 25 Jun 2019 02:12:39 +0000",
      "length": "16887333",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/b9429420-c15d-472f-a8aa-aa77002236a2/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561428785"
    },
    {
      "title": "Friday, June 21st 2019",
      "description": "Joe brings us the latest headlines in news and gaming including EAs new buzz word for loot boxes. Plus, we take a look at the top 25 games of all time according to metacritic.",
      "pubDate": "Sat, 22 Jun 2019 02:02:28 +0000",
      "length": "11673730",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/822622c4-3cc5-42ad-ab1b-aa74001ffc66/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561168969"
    },
    {
      "title": "Wednesday, June 19th 2019",
      "description": "With all the great news that came out of E3 2019, it wasn't without it's controversies. This year notable streamer, DrDisrespect made headlines for all the wrong reasons. Plus, we go to Web MD to see who has a 'gaming addiction' problem. Robbie also brings us a new list, this time showcasing the most popular slang by year.",
      "pubDate": "Thu, 20 Jun 2019 05:18:10 +0000",
      "length": "22945288",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/14cb82d4-7501-4e4f-ade2-aa7200560d63/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1561007938"
    },
    {
      "title": "Tuesday, June 18th 2019 feat AJ from Fanatix Four",
      "description": "The Checkpoint XP crew sits down with AJ from the Fanatix Four YouTube channel to talk about the latest announcements Nintendo made from E3 2019. Plus, Sarah joins us as usual with the latest headlines in gaming and esports. We also asked our social media followers what game they loved to binge during summer breaks.",
      "pubDate": "Wed, 19 Jun 2019 02:41:39 +0000",
      "length": "24081656",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/ef0914a3-c31b-418b-a29f-aa710029a23b/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1560912135"
    },
    {
      "title": "Monday, June 17th 2019",
      "description": "With the entire crew finally back from E3, we start by catching up on how the trip went. Plus, what did everyone get up to during their down time this weekend? Joe also brings what he calls a 'new' game, but we've heard this song and dance before...",
      "pubDate": "Tue, 18 Jun 2019 02:02:20 +0000",
      "length": "18357019",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/bc447572-9063-4b5f-9bec-aa70002063be/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1560823389"
    },
    {
      "title": "Friday, June 14th 2019 - E3 2019 Special",
      "description": "Today on Checkpoint XP we feature more interviews from E3 2019 as well as Robbie and Norris' visit to the Blizzard Arena! We'll start things off catching up with the first guest we ever had on Checkpoint XP - Austin Creed of UpUpDownDown. We'll also check out conversations with Dogman of the Atlanta Reign, Harsha Bandi Assistant Coach for the Vancouver Titans, and we'll catch up with friend of the show NoTE of the Dallas Fuel.",
      "pubDate": "Sat, 15 Jun 2019 04:22:41 +0000",
      "length": "18630055",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/d927e275-c6cd-47cd-a812-aa6d0046052d/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1560572596"
    },
    {
      "title": "Thursday, June 13th 2019 - E3 2019 Interview Special",
      "description": "While out at E3 Norris managed to sneak off to the LCS arena and talk with caster Azael. Christine also had a great chat with the Anastasia Staten of the ESA. Plus, we talk to the developers behind the game We Met in May.",
      "pubDate": "Thu, 13 Jun 2019 23:34:20 +0000",
      "length": "17429907",
      "audioUrl": "https://traffic.omny.fm/d/clips/58a22c8d-1810-4cd1-bce2-a849004eeede/319d8bef-ae60-4b5c-b7c8-a9ab013849a8/92e9e81f-5c8c-4f93-b263-aa6b01832193/audio.mp3?utm_source=Podcast&in_playlist=7a5a668c-57ff-4d89-ad8f-a9ab01389195&t=1560468892"
    }
  ]
}